Catalogs/ПроизводственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПроизводственныеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтоимостьВыработкиПотолок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтоимостьВыработкиОтрез</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтоимостьВыработкиМногофактурныйПотолок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтоимостьВыработкиМногофактурныйОтрез</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоВыработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыработкиПотолок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыработкиОтрез</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыработкиМногофактурныйПотолок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыработкиМногофактурныйОтрез</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПроизводственныеОперации/Ext/ManagerModule.bsl
Функция НоменклатураПринадлежитОперации(Операция, Номенклатура) Экспорт

	Результат = Ложь;
	
	Если НЕ Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура") = Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ Результат Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		Отбор.Вставить("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
		НайденныеСтроки = Операция.УДАЛИТЬ_СписокНоменклатуры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Результат = Истина;
		КонецЕсли;
		//Если НЕ Операция.СписокНоменклатуры.Найти(Номенклатура.ВидНоменклатуры,"ВидНоменклатуры") = Неопределено Тогда
		//	Результат = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтоимостьОпределятьПоВыработке(Операция, Номенклатура) Экспорт
	
	ИскомаяСтрока = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура");
	
	Если НЕ ИскомаяСтрока = Неопределено Тогда
		Возврат ИскомаяСтрока.КоличествоПоВыработке;
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		Отбор.Вставить("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
		НайденныеСтроки = Операция.УДАЛИТЬ_СписокНоменклатуры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0].КоличествоПоВыработке;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	
КонецФункции

Функция ПолучитьСтоимостьВыработкиПоВидуПотолка(Операция, НоменклатураПотолок, Номенклатура) Экспорт
	
	Результат = 0;
	СтрокаЦены = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура");
	Если СтрокаЦены = Неопределено Тогда
		СтрокаЦены = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура.ВидНоменклатуры,"ВидНоменклатуры");
	КонецЕсли;
	
	Если НЕ СтрокаЦены = Неопределено Тогда
		Если НоменклатураПотолок.Потолок_ОбщаяДлинаГарпуна = 0 Тогда
			Если НоменклатураПотолок.Потолок_Многфактурный Тогда
				Результат = СтрокаЦены.СтоимостьВыработкиМногофактурныйОтрез;
			Иначе
				Результат = СтрокаЦены.СтоимостьВыработкиОтрез;
			КонецЕсли;
		Иначе
			Если НоменклатураПотолок.Потолок_Многфактурный Тогда
				Результат = СтрокаЦены.СтоимостьВыработкиМногофактурныйПотолок;
			Иначе
				Результат = СтрокаЦены.СтоимостьВыработкиПотолок;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
